title: CobaltStrike Service Installations - Security
id: d7a95147-145f-4678-b85d-d1ff4a3bb3f6

status: test

description: Detects known malicious service installations used by Cobalt Strike during privilege escalation or lateral movement.

author: Florian Roth (Nextron Systems), Wojciech Lesicki

date: 2021-05-26
modified: 2022-11-27

logsource:
  product: windows
  service: security

detection:
  event_id:
    EventID: 4697

  selection1:
    ServiceFileName|contains|all:
      - "ADMIN$"
      - ".exe"

  selection2:
    ServiceFileName|contains|all:
      - "%COMSPEC%"
      - "start"
      - "powershell"

  selection3:
    ServiceFileName|contains:
      - "powershell -nop -w hidden -encodedcommand"

  condition: event_id and 1 of selection*

falsepositives:
  - Unknown

level: high

tags:
  - attack.persistence
  - attack.execution
  - attack.privilege-escalation
  - attack.t1543.003